import { Metadata } from 'next';

import { PolicyContainer } from '../PolicyContainer';

export const metadata: Metadata = {
  title: 'プライバシーポリシー',
};

const text = `根本将治（以下「当社」といいます。）は、当社がTRECo（以下「本サービス」といいます。）を提供するにあたり、ご利用される皆様（以下「利用者」といいます。）の個人に関する情報（以下「個人情報」といいます。）を取得します。

（適用範囲）
本プライバシーポリシー（以下「本ポリシー」といいます。）は、当社が利用者から個人情報を取得、利用及び管理するときに適用されます。

（取得する情報）
当社は、利用者から以下の情報を取得します。
- 連絡先
- 情報通信端末の機体識別に関する情報
- 位置情報
- IPアドレス
- 閲覧したURL及び日時に関するタイムスタンプ

（利用目的）
当社が個人情報を収集・利用する目的は、以下のとおりです。
- 本サービスの提供・運営のため
- 広告効果の分析、市場分析、マーケティングのため
- 不正アクセス、不正利用の防止のため
- 本サービスその他のコンテンツの開発・改善のため
- 上記の利用目的に付随する目的

（Cookieの利用）
当社は、ウェブサイト及び本サービス（以下、これらを総称して「ウェブサイト等」といいます。）のアクセス及び利用状況の分析、広告配信並びにウェブサイト等の利便性向上のために、ウェブサイト等にアクセスした利用者の情報通信端末に保存されるCookie等のファイル及びこれに類似する技術を取得することがあります。当社は、Cookie等と利用者の個人情報を関連付けることがあります。当社は、利用者の個人情報と関連付けたCookie等が利用者の個人情報であることに鑑み、当該Cookie等を本個人情報保護方針の定めに従って管理いたします。また、当社は、Cookie等の情報を第三者が運営するデータ・マネジメント・プラットフォームに提供し、当該第三者からCookie等により収集されたウェブの閲覧履歴及びその分析結果を取得し、これらを利用者の個人データと結び付けた上で、広告配信等の目的で利用することがあります。

（安全確保の措置）
当社は、収集した情報の漏えい、滅失又はき損の防止その他収集した情報の適切な管理のために必要な措置を講じます。当社が、安全管理のために講じた措置の概要は以下のとおりです。措置の具体的内容については、本ポリシーで定める窓口に対する利用者からの求めに応じて遅滞なく回答いたします。

（個人情報の第三者への提供）
当社は、次に掲げる場合を除いて、あらかじめ利用者の同意を得ないで、取得した個人情報を第三者に提供することはありません。
- 法令に基づく場合
- 人の生命、身体又は財産の保護のために必要がある場合であって、利用者の同意を得ることが困難であるとき。
- 公衆衛生の向上又は児童の健全な育成の推進のために特に必要がある場合であって、利用者の同意を得ることが困難であるとき。
- 国の機関若しくは地方公共団体又はその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、利用者の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがあるとき。
- 前項の定めにかかわらず、次に掲げる場合には、当該個人情報の提供先は第三者に該当しないものとします。
- 当社が利用目的の達成に必要な範囲内において個人情報の取扱いの全部又は一部を委託することに伴って当該個人情報が提供される場合
- 合併その他の事由による事業の承継に伴って個人情報が提供される場合

（個人情報の共同利用）
当社は、特定の者との間で共同利用することを目的として個人情報を当該特定の者に提供することがあります。この場合、当社は、あらかじめ、共同して利用する個人情報の項目、共同して利用する者の範囲、利用する者の利用目的及び当該個人情報の管理について責任を有する者の氏名又は名称を公表するものとします。

（本プライバシーポリシーの変更）
当社は、法令改正への対応の必要性及び事業上の必要性に応じて、本ポリシーを変更する場合があります。本ポリシーの変更を行った場合には、本ウェブサイト上に掲載します。

（開示、訂正等の手続）
利用者は、本条に従って、当社に対し以下の求め又は請求を行うことができます。
- 利用者から個人情報の利用目的の通知の求め
- 利用者の個人情報の開示の請求
- 当社が保有する利用者の個人情報の内容が事実でない場合における、当該内容の訂正、追加又は削除の請求
- 利用者の個人情報が利用者に対して通知若しくは公表した利用目的の達成に必要な範囲を超えて取り扱われた場合又は当該個人情報が偽りその他不正の手段によって取得された場合における、当該個人情報の利用の停止又は消去の請求
- 利用者の個人情報が個人情報保護法第23条第1項又は第24条の規定に違反して第三者に提供されている場合における、当該個人情報の第三者への提供の停止の請求
- 前項の求め又は請求にあたっては、同項各号のうちいずれの請求か特定の上、本人確認のための書類（運転免許証、健康保険証、住民票の写し等）をご提出頂きます。
- 第1項第1号の求め又は第2号の請求については、1件につき、1,000円の手数料をご負担頂きますのであらかじめご了承ください。

（お問い合わせ）
当社の個人情報の取扱いに関するご相談や苦情等のお問い合わせについては、下記の窓口にご連絡ください。
個人情報取扱事業者：根本将治
Eメールアドレス： nemoto.masaharu.it@gmail.com
Twitter: https://twitter.com/harusame0616`;

export default function PrivacyPolicyPage() {
  return <PolicyContainer title="プライバシーポリシー">{text}</PolicyContainer>;
}
